cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'thoughtbot/formulae'
tap 'd12frosted/emacs-plus'
tap 'neovim/neovim'

brew 'rcm'
brew 'mas'

brew 'elixir'
brew 'python'
brew 'python3'
brew 'flow'

brew 'git'
brew 'gitsh'
brew 'git-extras'
brew 'git-lfs'
brew 'hub'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ctags'
brew 'graphviz'
brew 'ripgrep'
brew 'mosh'
brew 'asciinema'
brew 'coreutils'
brew 'slurm'

brew 'zsh'
brew 'zplug'
brew 'fish'

brew 'the_silver_searcher'
brew 'fzf'

brew 'vim', args: ['override-system-vi', 'with-lua', 'with-perl', 'with-python3', 'with-ruby']
brew 'neovim'
brew 'emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick', 'with-spacemacs-icon']

brew 'htop'
brew 'httpie'
brew 'jq'
brew 'jid'
brew 'cheat'
brew 'sshrc'

brew 'wget', args: ['enable-iri']
brew 'nmap'
brew 'zmap'

brew 'postgresql'
brew 'redis'
brew 'mysql'
brew 'sqlite'
brew 'mongodb'
brew 'rethinkdb'

brew 'purescript'
brew 'haskell-stack'
brew 'ocaml'
brew 'opam'

brew 'jenv'
brew 'rbenv'
brew 'nvm'

brew 'kubectl'
brew 'leiningen'
brew 'nginx'

brew 'thefuck'

brew 'weechat', args: ['with-python', 'with-perl']
brew 'irssi'

cask 'iterm2'
cask 'nvalt'

cask 'virtualbox'
cask 'vagrant'
cask 'docker'
cask 'kitematic'

cask 'dropbox'
cask 'transmission'

cask 'slate'
cask 'amethyst'
cask 'showyedge'
cask 'flux'
cask 'toggldesktop'
cask 'gyazo'

cask 'macvim'
cask 'visual-studio-code'
cask 'lighttable'

cask 'skype'
cask 'telegram-desktop-dev'
cask 'discord'
cask 'gitter'
cask 'slack-beta'
cask 'screenhero'
cask 'teamviewer'

cask 'vlc'
cask 'wireshark'
cask 'tunnelblick'

cask 'java'
cask 'java6'
cask 'java7'

cask 'pgadmin3'
cask 'google-cloud-sdk'

cask 'torbrowser'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'opera'
cask 'opera-developer'
cask 'mist'

# quick look plugins
# https://github.com/sindresorhus/quick-look-plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# fonts

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-courier-prime'
cask 'font-source-serif-pro'
cask 'font-hack'

# apps from appstore

mas 'Xcode', id: 497799835
mas 'Alfred', id: 405843582
mas 'Helium', id: 1054607607
mas 'Pixen', id: 525180431
mas 'Noizio', id: 928871589
mas 'TweetDeck', id: 485812721
