cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'thoughtbot/formulae'
tap 'neovim/neovim'
tap 'ethereum/ethereum'
tap 'coursier/formulas'

brew 'rcm'
brew 'mas'

cask 'java'
cask 'java6'

brew 'rust'
brew 'elixir'
brew 'python'
brew 'python3'
brew 'flow'
brew 'go'
brew 'ponyc'
brew 'sbt'
brew 'coursier/formulas/coursier', args: ['HEAD']

brew 'sdl2'

brew 'pgcli'
brew 'mycli'

brew 'git'
brew 'gitsh'
brew 'git-extras'
brew 'git-lfs'
brew 'hub'
brew 'tmux'
brew 'ctags'
brew 'graphviz'
brew 'ripgrep'
brew 'mosh'
brew 'ispell'
brew 'm-cli'
brew 'ccat'
brew 'asciinema'
brew 'coreutils'
brew 'ranger'
brew 'slurm'
brew 'gpg'
brew 'ethereum'
brew 'swagger-codegen'

brew 'zsh'
brew 'zplug'
brew 'fish'

brew 'the_silver_searcher'
brew 'fzf'

brew 'neovim'
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-perl', 'with-python3', 'with-ruby']

brew 'htop'
brew 'httpie'
brew 'jq'
brew 'jid'
brew 'cheat'
brew 'sshrc'

brew 'wget', args: ['enable-iri']
brew 'nmap'
brew 'zmap'

brew 'postgresql'
brew 'redis'
brew 'mysql'
brew 'sqlite'
brew 'mongodb'
brew 'rethinkdb'

brew 'llvm', args: ['with-clang', 'with-libcxx']
brew 'purescript'
brew 'haskell-stack'
brew 'ocaml'
brew 'opam'

brew 'autoconf'
brew 'automake'
brew 'nasm'
brew 'bochs'
brew 'qemu'
brew 'xorriso'
brew 'gmp'
brew 'cairo'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'

brew 'jenv'
brew 'rbenv'
brew 'nvm'

brew 'kubectl'
brew 'leiningen'
brew 'nginx'

brew 'imagemagick'
brew 'ffmpeg'

brew 'weechat', args: ['with-python', 'with-perl']
brew 'irssi'

cask 'iterm2'
cask 'nvalt'

cask 'virtualbox'
cask 'vagrant'
cask 'docker'
cask 'kitematic'

cask 'dropbox'
cask 'transmission'

cask 'the-unarchiver'
cask 'slate'
cask 'amethyst'
cask 'showyedge'
cask 'flux'
cask 'toggldesktop'
cask 'gyazo'
cask 'ngrok'

cask 'macvim'
cask 'emacs'
cask 'visual-studio-code'
cask 'lighttable'
cask 'intellij-idea-ce'

cask 'skype'
cask 'telegram-desktop-dev'
cask 'discord'
cask 'gitter'
cask 'slack-beta'
cask 'screenhero'
cask 'teamviewer'

cask 'kap'
cask 'vlc'
cask 'wireshark'
cask 'tunnelblick'
cask 'gpgtools'
cask 'keybase'
cask 'nylas-mail'

cask 'pgadmin4'
cask 'google-cloud-sdk'

cask 'torbrowser'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'opera'
cask 'opera-developer'
cask 'mist'
cask 'brave'

cask 'hex-fiend'
cask '0xed'

# quick look plugins
# https://github.com/sindresorhus/quick-look-plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

cask 'twitch'

# fonts

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-courier-prime'
cask 'font-source-serif-pro'
cask 'font-hack'
cask 'font-fira-code'

cask 'osxfuse' # for dired-avfs (which is required for dired-hacks)
brew 'avfs'    # because it depends on osxfuse

# apps from appstore

mas 'Xcode', id: 497799835
mas 'Helium', id: 1054607607
mas 'Pixen', id: 525180431
mas 'Noizio', id: 928871589
mas 'TweetDeck', id: 485812721
mas 'Monosnap', id: 540348655
mas 'Twitter', id: 409789998

# see README.md for a list of paid apps that I use
